const favorite = {
    firstname: "Jhon",
    surname: "Week",
    age: 35,
    from: "New york",
    year: 1985
}

favorite.from = "Germany"; // from შევცვალეთ კუთვნილება
favorite.age = 38; // age შევცვალეთ კუთვნილება

favorite.villige = "IDK"; //  აქ დავამატე ახალი კუთვნილება villige
delete favorite.villige
console.log(favorite)
// obiect - ჩვენს გარშემო რასაც ვხედავთ და ვეხებით ყველაფერი არის ობიექტი , მაგალითად კურსორი რომ გავამოძრავო
// დოტ ნოტაცია წერტილის ნოტაცია . ჩვენ შეგვიძლია ავირჩიოთ ჩვენი ობიექტის კონკრეტულ კუთვნილება.

// 1) შექმენით ობიექტი სადაც ჩაწერთ თვქენი საყვარელი პერსონაჟის მონაცემებს, დაამატეთ მინიმუმ 5 კუთვნილება თავიდანვე, შემდეგ დაბეჭდეთ ხუთივე კუთვნილება ცალ-ცალკე, შემდეგ შეცვალეთ რომელიმე ორი კუთვნილება და დაბეჭდეთ თავიდან ბოლომდე ობიექტი, საბოლოოდ დაამატეთ ერთი კუთვნილება და წაშალეთ რომელიმე ძველი კუთვნილება, კომენტარებით აუცილებლად ახზსენით თუ რას ნიშნავს ობიექტი, რაში გამოიყენება, რატომ არის მაგარი, რა არის კუთვნილება და რას ნიშნევას წერტილის ნოტაცია
