// 1) შემოგდით n და n ზომის მასივი. დაბეჭდეთ მასივის ორი უდიდესი ელემენტის ჯამი.
// მაგ 5, 18 12 40 1 19
// პასუხია 40+19=59.

let numb = [1,2,3,4,5,6,7,8,9,10]
let n = function(nm){ 
    return nm * 2
}
console.log(n)


// 2) შემოგდით n და n ზომის მასივი. თქვენი ამოცანაა იპოვოთ მასივში ყველაზე ბოლოს გამეორებული ელემენტი და დაბეჭდოთ იგი. თუ  ასეთი ელემენტი არ არსებობს დაბეჭდეთ რომ მასივში არცერთი ელემენტი არ მეორდება
// მაგ : 5, 1 3 4 1 3 12 
// პასუხია 3 (მასივში გამიმეორდა 1-იანი და 3-იანი თუმცა რადგან 3 უფრო გვიან გამეორდა ეგაა საძებნი ელემენტიც)    

// let n = [1,2,3,4,5,6,7,8,9,10]
// let set2 = new Set()

// for(let i in n){
//     if(set2.has(i)) {
//         console.log("ნაპოვნია ერთნაირი რიცხვი")
//     } 

//     if(!set2.has(i)) {
//         console.log("არ არი განმეორებადი რიცხვი")
//     }
// }

// 3) შემოდის n და n ზომის მასივი. თქვენი  ამოცანაა თითოეული ელემენტისთვის დაბეჭდოთ მის მარცხნივ მყოფ ელემენტებს შორის რამდენზე მეტია იგი.

// მაგ  n=5, 3 2 6 5 1

// პასუხია 0,0,2,2,0  (3-ის წინ არცერთი ელემეტნია, 2ის წინ 3ია თუმცა არაა მასზე მეტი , 6ის წინ 3 და 2  წერია რადგან ორივეზე მეტია დაიბეჭდება 2, 5ის 3 2 6 წერია ამათგან 2 მათგანზე მეტია აქაც 2 და ბოლოს 1იანი არცერთზე მეტი არაა და დაიბეჭდება 0 )

// n = [1,2,3,4,5]
// for(let i in n) {
//     if(i[1]>i[2]) {
//         console.log("მეტია")
//     } else if(i[1]<i[2]) {
//         console.log("ნაკლებია")
//     }
// }