# 1) შექმენით ფუქცია რომელიც გამოიტანს ("გამარჯობა")-ს (ვოიდ ფუნქცია)

# def greet(hel):
#     print(hel)
# greet("Hello")


# 2) შექმენით ფუნქცია რომელსაც გადაეცემა სახელის არგუმენტი და გამოიტანს ამ სახელის მისალმებას (მაგ: "გამარჯობა, ლაშა")
# (ვოიდ ფუნქცია)

# def Myfunc(hel):
#     print(hel)

# Myfunc("Gamarjoba Zuka")


# 3) შექმენით ფუნქცია რომელიც აბრუნებს გადაცემულ რიცხვზე ერთით მეტს (მაგ: 55->56)  (ჩვეულებრივი ფუნქცია)

# def numbers(n):
#     n = [1,2,3,4]
#     return n > 10
# print(numbers([1,2,3,4,5]))


# 4) შექმენით ფუნქცია რომელიც აბრუნებს არა-ნეგატიური რიცხვის ნეგატიურ ვერსიას და შემდეგ გამოიყენეთ ეს ფუნქცია რომ გამოიტანოთ დაბრუნებულზე ერთით მეტი რიცხვი (მაგ: თუ ფუნქციას გადავეცით 44 საბოლლოდ უნდა გამოვიტანოთ (კონსოლში) -43 ) (ჩვეულებრივი ფუნქცია)

# def nums(num1):
#     if num1 %2 == 0:
#         return num1
# print(nums([1,23,4,5]))

