// // 5) გავაკეთოთ ფუნქცია რომელიც გადაცემული ID-ს მიხედვით აბრუნებს html-ის ელემენტს (მაგ: "first" -> document.getElementbyId("first")) შემდეგ კი გამოიყენეთ ეს ფუნქცია რომ დაბრუნბულ ელემენტს 3 ატრიბუტი შევუცვალოთ (მაგ: color, backgroundColor, textContent) (ჩვეულებრიივი ფუნქცია)
// WARNING!! ⚠️ (გამოვიყნოთ შესაბამისი სახელები და დავიცვათ ჯავასკრიპტის 'camel-case'  სტრუქტურა, ასევე ძალიან გთხოვთ გამოიყენეთ external ჯავასკრიპტი, ანუ ჯავასკრიპტის კოდი ცალკე ფაილში დაწერეთ)
// ბონუსი: გავაკეთოთ მოკლე პრეზენტაცია მაგალიტებით ნამდვილი და პროგრამირების სამყაროდან ვოიდ და ჩვეულებრივ ფუნქციებზე, (რითი განსხვავდება ერთმანეთისგან და რა არის return-ი)

// const person = {
//     firstname: "Zuka",
//     lastname: "Qoridze",
//     age: 15
// }

// console.log(person.firstname)