// function myname() {
//     console.log("Zuka")
//     console.log("Qoridze")
// }

// myname()

// const clicked = document.getElementById("yrname");

// clicked.addEventListener("click",function() {
//     alert("Ynow name");
// })

// კომენტარებით ახსენით წინა 2 დავალება, ასევე დაწერეთ როგორ ვქმნით JavaScript-ში ფუნქციას და რა განსხვავებაა Python-ისა და JS-ს კოდის ბლოკებს შორის

// 1) მე შევქმენი ფუნცქია და შემდეგ კოდის ბლოკი ანუ დავწერე კოდი console.log რომ გამოეტანა მაგრამ არ გამოიტანდა იმიტომ რომ ფუნქცია არ იყო გამოძახებული და გამოვიძახე ფუნქცია ფუნქციის სახელით და ორი ფრჩხილით
// 2)მე აქ გამოვიყენე addeventlistener ანუ მოხდეს რაღაც ჩვენ საიტზე მაგალითად როდესაც დავაჭერთ ასევე შეგვიძლია გავაკეთოთ უამრავ რამეზე მაგალითად რომ ჩამოვსქროლავთ გამოიტანოს რაიმე

// ჩვენ javascript ში ფუნქციას ვქმნით, ჯერ ვწერთ function და შემდეგ ფუნქციის სახელი მაგალითად function greet.


// 4)

// ინდეტაცია - არის ძალიან მაგარი რაღაცა კოდს ხდის ესე ვიტყვი უფრო ლამაზ შესახედავს
// კომენტარები - კომენტარები არის საუკეთესო ჩემთვის მაგალითად დავწერე რაიმე კოდი და მაგ კოდს განხილვას კომენტარით ავღწერ და ეხლაც კომენტარის საშუალებით ვწერ
// შესაბამისი სახელი - ფუნქციის შესაბამისი სახელი, ცვლადის შესაბამისი სახელი, ესეც ჩემთვის საუკეთესო პრაქტიკაა მაგალითად name="Zuka" ეხლა ვინმე რომ შეხედავს name მიხვდება რომ სახელი წერია შიგნით

// 5) მომხარებელს შემოატანინეთ თავიანთი სახელი და გვარი, შემდეგ კი console-ში გამოიტანეთ რომ ეს კონკრეტული დარეგისტრირდა
let FirstName = prompt("Enter your name")
let Surname = prompt("Enter your surname")

console.log("You registered",FirstName,Surname)