// 1) ხელით შეავსეთ 5-ელემენტიანი მთელი რიცხვების მასივი და გამობეჭდეთ მე-2 და მე-4 ინდექსზე მყოფი ელემენტები.

// const numList = [1,2,3,4,5];

// console.log(numList[2][4])


// 2) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი. შეავსეთ მასივი (0 დან) შეყვანილი რიცხვებით და გამობეჭდეთ კენტ ინდექსზე მყოფი ელემენტები ( a[1], a[3], a[5]...)

// const numList = [1,2,3,4,5,6,7,8,9,10]

// function odd() {
//     for(let i = 0; i > numList.length; i++) {
//         if(numList %3 === 0) {
//             console.log(i)
//         }
//     }
// }
// odd()


// 3) აღწერეთ 10 ელემენტიანი მთელი რიცხვების მასივი, შეიყვანეთ კონსოლიდან 10 ელემენტი (for-ით), მასივში არსებული რიცხვები გააორმაგეთ და გამობეჭდეთ ეკრანზე

// const numList = [1,2,3,4,5,6,7,8,9,10];

// console.log(numList.push([11,12,13,14,15,16,17,18,19,20]));

// 4) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი. შეინახეთ რიცხვები მასივში და გამობეჭდეთ შებრუნებული თანმიმდევრობით. (მაგ: თუ რიცხვებია 5 7 12, გამობეჭდეთ 12, 7, 5)


// const nums = [5, 7, 12];

// console.log(nums[-1])


// 5) შემოგდით N, შემდეგ N ცალი რიცხვი. შეინახეთ მასივში, ადგილი გაუცვალეთ პირველ და ბოლო ელემენტს, და მასივი გამობეჭდეთ ეკრანზე.

// const nums = [1,3,45,2,0]

// console.log(nums[-1][1])