# ფუნქცია რომრლდაც გადაეცემა სამი არგუმენტი (რიცხვი , მეორე რიცხვი, მათემატიკური სიმბოლო (მიმატება, გამრავლება, გამოკლება, გაყოფა) და აბრუნებს შესაბამის შედეგს

def math(num1, num2, op): 
    if op != ["+","*","-","/"]:
        print("You dont have any operator")

    if op == "+": # ანუ თუ არის დამატება
        return num1 + num2 # მაშინ პრიველ რიცხვს დაემატოს მეორე რიცხვი
    if op == "*": # ანუ თუ არის გამრავლება
        return num1 * num2 # მაშინ პირველი რიცხვი გამრავლდეს მეორე რიცხვზე
    if op == "-": # თუ არის გამოკლება 
        return num1 - num2 # მაშინ პირველ რიცხვს გამოაკლდეს მეორე რიცხვი
    if op == "/": # თუ არის გაყოფა
        return num1 / num2 # მაშინ პირველი რიცხვი გაიყოს მეორე რიცხვზე

