// 1) შექმენით ფუნქცია რომელსაც გადაეცემა მატრიცა ( 2დ მასივი ) და დააბრუნებს მასივს უნიკალური ელემენტებით (ელემენტი რომელიც მთლიან მასივში ერთხელაა)
// 2) შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგი და დააბრუნებს რომელი ელემენტი (ასო ან ქარაქთერი) ხვდება ყველაზე ხშირად, თუმცა თუ რამოდენიმე ქარაქთერი ერთი და იგივე სიხშირისაა მაშინ მასივში დააბრუნოს ისინი.
// წარმატებები❤️  (მინიშნება: მეორე ამოცანისთვის შეგიძლიათ გამოიყენოთ სიხშირეების მაგიდა, თუმცა სხვა გზებიც არსებობს💜 )

// function checkMassive(){
//     const mas = [1,2,3,4]
//     let count = 0

//     for(let i in mas) {
//         count = mas[i]
//         if(count==0) {
//             return false
//         } else {
//             return true
//         }
//     }
// }
// checkMassive()

// function Checkwords(inputt){
//     if(inputt == [0-9,a-z]) {
//         return alert("მოიძებნა რიცხვები და სიტყვები")
//     }
// }
// Checkwords()